app/Controllers/Admin.php

    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/')->with('error', 'Accès refusé.');
        }

        $db = \Config\Database::connect();

        $data['totalUsers'] = $db->table('users')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `users`