app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `measurements`
WHERE `user_id` = 1
ORDER BY `measured_at` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `measurements`
WHERE `user_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `user_subscriptions`
WHERE `user_id` = 1
AND `status` = 'active'
---
    public function profile()
    {
        $userModel = new UserModel();
        $measureModel = new MeasurementsModel();

        $userId = session()->get('user_id');
        if (!$userId) {
            return redirect()->to('/login');
        }

        $user = $userModel->find($userId);
        $lastMeasures = $measureModel->where('user_id', $userId)->orderBy('measured_at', 'DESC')->first();

        // Nombre total de mesures
        $measureCount = $measureModel->where('user_id', $userId)->countAllResults();

        // Infos wallet (portefeuille / premium)
        $walletModel = new \App\Models\WalletModel();
        $wallet = $walletModel->chargerInfosWallet($userId);
        if (!is_array($wallet)) {
            $wallet = ['user_id' => $userId, 'balance' => 0.00, 'is_gold' => 0];
        }

        // Compter les abonnements actifs
        $db = \Config\Database::connect();
        $subscriptionCount = 0;
        try {
            $subscriptionCount = $db->table('user_subscriptions')
                ->where('user_id', $userId)
                ->where('status', 'active')
                ->countAllResults();